acclmcopy-cfe-consolidation/DataProcessors/Consd_СверкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Consd_СверкаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаймаутЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяOData</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольOData</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СДвижениямиХозрасчетный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИсточник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПриемник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСверки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URLСервераOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПользователяOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

acclmcopy-cfe-consolidation/DataProcessors/Consd_СверкаДанных/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;

	Если Объект.ТаймаутЗапроса = 0 Тогда
		Объект.ТаймаутЗапроса = 30;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ТипСверки) Тогда
		Объект.ТипСверки = НСтр("ru = 'Полная'");
	КонецЕсли;

	Если Объект.ИсточникиСверки.Количество() = 0 ИЛИ Объект.ОбъектыСверки.Количество() = 0 Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Если ОбработкаОбъект.ИсточникиСверки.Количество() = 0 Тогда
			ОбработкаОбъект.ЗаполнитьИсточникиИзРегистра();
		КонецЕсли;
		Если ОбработкаОбъект.ОбъектыСверки.Количество() = 0 Тогда
			ОбработкаОбъект.ЗаполнитьСписокОбъектов();
		КонецЕсли;
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИсточникиИзРегистраВыполнить(Команда)

	ЗагрузитьИсточникиИзРегистраНаСервере();

	Если Объект.ИсточникиСверки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В регистре сведений ""Consd_Источники"" нет записей.
			|Заполните регистр адресами баз-источников и повторите загрузку.'"));
	Иначе
		ПоказатьПредупреждение(, СтрШаблон(
			НСтр("ru = 'Загружено источников из регистра: %1.'"),
			Объект.ИсточникиСверки.Количество()));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОСВВыполнить(Команда)

	Если Объект.ИсточникиСверки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнен список источников сверки.'"));
		Возврат;
	КонецЕсли;

	Состояние(НСтр("ru = 'Формируется ОСВ по счетам, это может занять некоторое время...'"));
	СформироватьОСВНаСервере();
	Состояние();

	Если ОСВ.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для отображения ОСВ по счетам.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключенияВыполнить(Команда)

	Результат = ПроверитьПодключенияНаСервере();

	Если Результат.Успешно Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Подключение установлено ко всем источникам сверки.'"));
	Иначе
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Не удалось подключиться к части источников:
			|%1'"), Результат.ТекстОшибки));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеРегистраХозрасчетныйВыполнить(Команда)

	Результат = ПроверитьНаличиеРегистраХозрасчетныйНаСервере();

	Если Результат.Существует Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регистр Хозрасчетный доступен в стандартном
			|интерфейсе OData всех источников.'"));
	Иначе
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Регистр Хозрасчетный недоступен в части источников:
			|%1'"), Результат.ТекстОшибки));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокОбъектовВыполнить(Команда)

	ЗаполнитьСписокОбъектовНаСервере();
	ПоказатьПредупреждение(, НСтр("ru = 'Список объектов сверки обновлен.'"));

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуВыполнить(Команда)

	ТекстОшибкиЗаполнения = ПроверитьЗаполнениеПередСверкой();
	Если ЗначениеЗаполнено(ТекстОшибкиЗаполнения) Тогда
		ПоказатьПредупреждение(, ТекстОшибкиЗаполнения);
		Возврат;
	КонецЕсли;

	Состояние(НСтр("ru = 'Выполняется сверка данных, это может занять некоторое время...'"));
	ВыполнитьСверкуНаСервере();
	Состояние();

	ПоказатьПредупреждение(, НСтр("ru = 'Сверка данных завершена. Результаты доступны в таблице объектов.'"));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВыполнить(Команда)

	ТабличныйДокументОтчета = СформироватьОтчетНаСервере();

	ПараметрыФормы = Новый Структура("ТабличныйДокумент", ТабличныйДокументОтчета);
	ОткрытьФорму("Обработка.Consd_СверкаДанных.Форма.ФормаОтчета", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеОбъектыСверкиВыполнить(Команда)

	УстановитьВыборОбъектовСверки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборОбъектовСверкиВыполнить(Команда)

	УстановитьВыборОбъектовСверки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ДатаНачала = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = РезультатВыбора.КонецПериода;

КонецПроцедуры

// Устанавливает или снимает флаг "Выбран" у всех строк табличной части "ОбъектыСверки".
//
// Параметры:
// Выбран - Булево - значение флага выбора для всех строк.
//
&НаКлиенте
Процедура УстановитьВыборОбъектовСверки(Выбран)

	Для Каждого СтрокаОбъекта Из Объект.ОбъектыСверки Цикл
		СтрокаОбъекта.Выбран = Выбран;
	КонецЦикла;

КонецПроцедуры

// Проверяет заполнение обязательных параметров перед запуском сверки.
//
// Возвращаемое значение:
// Строка - текст ошибки или пустая строка, если проверка пройдена успешно.
//
&НаКлиенте
Функция ПроверитьЗаполнениеПередСверкой()

	Если Объект.ИсточникиСверки.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Не заполнен список источников сверки.'");
	КонецЕсли;

	Для Каждого СтрокаИсточника Из Объект.ИсточникиСверки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаИсточника.URLСервераOData) Тогда
			Возврат НСтр("ru = 'В списке источников есть строка с незаполненным URL сервера OData.'");
		КонецЕсли;
	КонецЦикла;

	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		Возврат НСтр("ru = 'Дата начала периода не может быть позже даты окончания периода.'");
	КонецЕсли;

	ЕстьВыбранныеСтроки = Ложь;
	Для Каждого СтрокаОбъекта Из Объект.ОбъектыСверки Цикл
		Если СтрокаОбъекта.Выбран Тогда
			ЕстьВыбранныеСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЕстьВыбранныеСтроки Тогда
		Возврат НСтр("ru = 'Не выбрано ни одного объекта для сверки.'");
	КонецЕсли;

	Возврат "";

КонецФункции

&НаСервере
Процедура ЗагрузитьИсточникиИзРегистраНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьИсточникиИзРегистра();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура СформироватьОСВНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаОСВ = ОбработкаОбъект.ПолучитьОСВСравнениеПоСчетам();
	ОСВ.Загрузить(ТаблицаОСВ);

КонецПроцедуры

&НаСервере
Функция ПроверитьПодключенияНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПроверитьПодключения();

КонецФункции

&НаСервере
Функция ПроверитьНаличиеРегистраХозрасчетныйНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПроверитьНаличиеРегистраХозрасчетный();

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокОбъектовНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСписокОбъектов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ВыполнитьСверкуНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьСверку();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.СформироватьОтчет();

КонецФункции

&НаСервере
Процедура ИмяПользователяOData1ПриИзмененииНаСервере()
	Для каждого Стр Из Объект.ИсточникиСверки Цикл

		Стр.ИмяПользователяOData  = Объект.ИмяПользователяOData;
		Стр.ПарольOData = Объект.ПарольOData;

	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяOData1ПриИзменении(Элемент)
	ИмяПользователяOData1ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПарольOData1ПриИзменении(Элемент)
	ИмяПользователяOData1ПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
